Repository: Juan-Alvarez/htan
Catalog: localization/*/LC_MESSAGES/htan.po
Languages: ru

source: Hi %s!
ru: Привет, %s!

source: This script will help to configure the server for web hosting.
ru: Этот скрипт поможет провести настройку сервера для веб-хостинга.\nВ процессе настройки от вас может потребоваться принятие решений.

source: To this server will be installed the following components:
ru: На сервер будут установлены следующие компоненты:

source: Optionally can be installed the following components:
ru: Опционально могут быть установлены следующие компоненты:

source: Will be configured the following components:
ru: Будет выполнена конфигурация следующих элементов:

source: System configuration
ru: Конфигурация системы

source: Do you want to continue?
ru: Хотите продолжить?

source: Goodbye!
ru: До свидания!

source: WARNING: To avoid problems, it is recommended to execute the script as root.
ru: ВНИМАНИЕ: Для удобства и минимизации возникновения ошибок в процессе работы скрипта, рекомендуется запускать его под пользователем root.

source: Do you want to restart this script as root?
ru: Хотите перезапустить скрипт под учетной записью root?

source: Many components will cannot be installed without root privileges.\nIt is highly recommended to restart the script as root.
ru: Многие компоненты будет просто невозможно установить без прав пользователя root.\nНастоятельно рекомендуется продолжить выполнение скрипта под учетной записью пользователя root.

source: Press Y, to restart the script with root privileges.\nPress N, to continue execution of the script under the current account (%s).
ru: Нажмите Y, чтобы войти под учетной записью root.\nНажмите N, чтобы попытаться выполнить скрипт под учетной записью %s (нет никаких гарантий, что все пройдет гладко).

source: Let's try...
ru: Попробуем, может что и получится...

source: Let's go!
ru: Поехали!

source: Probably the previous installation process was not completed or was completed incorrectly.\nPress Y, to continue where it left off.\nPress N, to start the installation again.
ru: Вероятно, предыдущий процесс работы скрипта был прерван или завершился некорректно.\nНажмите Y, чтобы продолжить выполнение предыдущей сессии (рекомендуется).\nНажмите N, чтобы начать процесс установки и конфигурации заново.

source: Do you want to continue the previous session?
ru: Хотите продолжить с места остановки предыдущего запуска?

source: Hostname
ru: Имя хоста

source: Server IP
ru: IP сервера

source: CPU
ru: Процессор

source: RAM
ru: Оперативная память

source: HDD
ru: Жесткий диск

source: Installed packages:
ru: На сервер установлены следующие пакеты:

source: The server is configured!
ru: Настройка сервера завершена!

source: Information to access the components of the server can be found in the file: %s.
ru: Информацию о конфигурации и параметрах доступа к компонентам сервера можно найти в файле: %s.

source: Do you want to send the file by email?
ru: Хотите отправить этот файл по email?

source: Sending a message …
ru: Отправка сообщения …

source: Do you want to see the log?
ru: Хотите посмотреть журнал?

source: Recommended to reboot the server.
ru: Для завершения, рекомендуется перезапустить сервер.

source: Do you want to reboot now?
ru: Хотите выполнить перезагрузку сейчас?

source: Failed to include the common.
ru: Не удалось выполнить подключение файла common.

source: # Configuring %s.
ru: # Конфигурация %s.

source: adduser creates a new user or sets the default information for new users.\nThis script creates the optimal for web hosting template directories and files for new users.\nEach new user will be member of the group www-data.\nAll new users, for security reasons, the default will be denied access through the shell.
ru: Команда adduser предназначена для добавления новых пользователей.\nДанный скрипт сформирует в /etc/skel оптимальный для веб-хостинга шаблон каталогов и файлов для новых пользователей.\nКаждый новый пользователь будет по умолчанию помещен в группу www-data.\nДля всех создаваемых пользователями каталогов будут выставлены разрешения 755.\nВсем новым пользователям, в целях безопасности, по умолчанию будет запрещен доступ через shell.

source: Enter the default shell:
ru: Введите shell по умолчанию:

source: Value cannot be empty.
ru: Значение не может быть пустым.

source: By default, the basic settings for the newly created users are in the folder %s.
ru: По умолчанию, базовые настройки для создаваемых пользователей находятся в папке %s.

source: Do you want to use this folder?
ru: Хотите использовать эту папку?

source: Enter the path to the folder SKEL:
ru: Введите путь к папке SKEL:

source: You must specify the path to the folder SKEL!
ru: Необходимо указать путь к папке SKEL!

source: Maybe better to use %s?
ru: Может лучше использовать %s?

source: The folder %s was not found.
ru: Папка %s не найдена.

source: Do you want to create a folder %s?
ru: Хотите создать папку %s?

source: Unable to create directory %s.
ru: Не удалось создать каталог %s.

source: Files and folders of %s will be automatically copied to the home user folder when adding a user (adduser).
ru: Содержимое каталога %s будет автоматически копироваться в папку пользователя при добавлении пользователя (adduser).

source: Would you like add to the directory %s the folder %s?
ru: Хотите добавить в каталог %s папку %s?

source: Do you want to add a new folder?
ru: Хотите добавить новую папку?

source: Enter the path to the folder:
ru: Введите путь к папке:

source: Created a new folder %s.
ru: Создана новая папка %s.

source: Enter the name of the group for a new users:
ru: Укажите название группы, в которую будут автоматически помещаться создаваемые пользователи:

source: Failed to create the group %s. Check the name of the group and try again.
ru: Не удалось создать группу %s. Проверьте имя группы и повторите попытку.

source: Set permissions that should have home directories for new users.
ru: Укажите разрешения, которые должны иметь домашние каталоги новых пользователей.

source: Enter the numeric code of permissions:
ru: Введите код необходимых разрешений:

source: Applying settings.
ru: Применение настроек.

source: Done.
ru: Готово.

source: # Installing and configuring %s.
ru: # Установка и настройка %s.

source: Fail2ban is an intrusion prevention software framework which protects computer servers from brute-force attacks.
ru: Fail2ban - программа для защиты сервера от различного вида атак.

source: %s has not been installed.
ru: Программа %s не была установлена.

source: # Installing %s.
ru: # Установка %s.

source: Midnight Commander is a visual file manager.
ru: Midnigth Commander - это файловый менеджер. Программа сделана в стиле FAR/Norton и может быть удобна при миграции с Windows систем.

source: Do you want to install the Developer Tools for PHP5?
ru: Хотите установить пакет для разработчиков PHP5?

source: phpPgAdmin is a web application, written in PHP, for managing PostgreSQL databases.
ru: Для управления PostgreSQL рекомендуется установить веб-панель - phpPgAdmin.

source: On this server is already installed %s.
ru: На сервере уже установлен пакет %s.

source: Would you like to configure? (the current settings will be overwritten)
ru: Хотите провести конфигурацию (файл настроек будет перезаписан)?

source: Would you like to configure?
ru: Хотите провести конфигурацию?

source: Operation canceled by the user.
ru: Операция прервана пользователем.

source: Creating configuration file for %s …
ru: Создание файла конфигурации %s …

source: Unable to configure %s. The file %s was not found.
ru: Невозможно настроить %s. Шаблон %s не найден.

source: Do you want to set up web access to %s?
ru: Хотите настроить веб-доступ к %s?

source: Enter the domain for %s:
ru: Введите домен, по которому можно будет получить доступ к %s:

source: Address
ru: Адрес

source: Root-access is prohibited for security reasons.
ru: Доступ для суперпользователя ограничен по соображениям безопасности.

source: When the emergency shutdown, the system can automatically check and try to fix file system errors (FSCKFIX).
ru: При аварийном завершении работы, система может проверить и попытаться автоматически исправить ошибки файловой системы (FSCKFIX).

source: Do you want to enable this option?
ru: Хотите включить эту опцию?

source: Testing for errors …
ru: Тест на наличие ошибок …

source: Testing %s …
ru: Тестирование %s …

source: Perhaps Apache is configured incorrectly.
ru: Вероятно, Apache настроен неправильно.

source: For details, see the error log of Apache:
ru: Для получения деталей, ознакомьтесь с журналом ошибок Apache:

source: Check the /etc/apache2/ports.conf and /etc/apache2/sites-enabled/000-default.conf.
ru: Проверьте файлы /etc/apache2/ports.conf и /etc/apache2/sites-enabled/000-default.conf.

source: To work with Nginx, Apache must listen on port %s.
ru: Для правильной работы с Nginx, следует ограничить обработку запросов Apache только локальным адресом 127.0.0.1:%s.

source: Mono is a free and open source project led by Xamarin to create an Ecma standard-compliant, .NET Framework-compatible set of tools including, among others, a C# compiler and a Common Language Runtime.
ru: Mono - набор компонентов для запуска приложений .NET Framеwork.

source: Do you want to install %s?
ru: Хотите установить %s?

source: Installation canceled by the user.
ru: Установка прервана пользователем.

source: Adding keys …
ru: Добавление ключей …

source: SSL support for Mono
ru: Пакет поддержки SSL для Mono

source: Building the test file …
ru: Сборка тестового файла …

source: Running the compiled file …
ru: Исполнение тестового файла …

source: File %s was not found. Probably the build process there were some problems.
ru: Файл %s не найден. Вероятно, во время компиляции возникли какие-то проблемы.

source: ## Installing and configuring Mono for ASP.NET.
ru: ## Установка и конфигурация Mono для ASP.NET.

source: Configuring Mono for Apache …
ru: Настройка модуля Mono для Apache …

source: Nmap is security and port scanner, network exploration tool.
ru: Nmap - это утилита для исследования сети и сканер портов.

source: It is recommended to scan the security of the server. But if you are only now configure the server, it is recommended to scan, after the server is restarted.
ru: Если вы впервые разворачиваете сервер, то рекомендуется провести проверку после перезагрузки, когда будут запущены все сетевые службы и межсетевой экран.

source: Do you want to scan ports now?
ru: Хотите провести сканирование портов сейчас?

source: To scan manually, perform the following command:
ru: Для запуска процесса сканирования вручную, выполните следующую команду:

source: Postfix is a free and open-source mail transfer agent (MTA) that routes and delivers electronic mail.
ru: В качестве почтового сервера рекомендуется использовать Postfix.\nPostfix — агент передачи почты (MTA — mail transfer agent).\nПомимо этого, для работы почтового сервера, будет установлен пакет mailutils.

source: Do you want to be notified about errors?
ru: Хотите получать по почте отчёты о работе сервисов и ошибках?

source: Do you want to send a test message?
ru: Хотите отправить тестовое письмо?

source: Secure Shell (SSH) is a cryptographic (encrypted) network protocol to allow remote login and other network services to operate securely over an unsecured network.
ru: Протокол SSH (Secure SHell) необходим для удаленного управления сервером через терминал.

source: By default, to connect to an SSH server uses port 22.\nTo increase security it is recommended to change the port number to any free port.
ru: По умолчанию для подключения к серверу SSH используется порт 22.\nДля безопасности рекомендуется изменить номер порта, поскольку стандартный порт будет подвергаться постоянным атакам.\nЖелательно, чтобы порт был свободен и не пересекался с другими службами сервера.\nОзнакомиться со списком стандартных портов можно в Википедиа:\nhttps://ru.wikipedia.org/wiki/Список_портов_TCP_и_UDP\nВы можете выбрать любой порт, который вам понравится.

source: With the current configuration, the SSH server is accessible on port %s.
ru: С текущей конфигурацией, сервер SSH доступен на порте %s.

source: Do you want to change the port number?
ru: Хотите изменить номер порта?

source: Enter the port number (between 1 024 and 65 535):
ru: Введите номер порта (в диапазоне от 1 024 до 65 535):

source: Expected integer ranging from 1 024 to 65 535.
ru: Ожидается целое число в диапазоне от 1 024 до 65 535.

source: To increase security, you can allow access to the connection to the server only to specific users.
ru: Для большей надежности вы можете разрешить доступ на подключение к серверу только определенным пользователям.

source: Enter the names of users who are allowed SSH connections:
ru: Укажите имена пользователей, которым разрешено подключение по протоколу SSH:

source: (you can specify more than one user by separating the names with a space)
ru: (можно указать более одного пользователя, разделяя имена пробелом)

source: It is strongly recommended to restrict the list of users to access via SSH.
ru: Настоятельно рекомендуется указать имена пользователей, которым должно быть доступно подключение через SSH.

source: You really do not want to introduce restrictions on access to server over SSH?
ru: Вы действительно не хотите ограничивать доступ к серверу SSH?

source: You can at any time, can change the configuration of the SSH server in the file %s.
ru: Вы можете в любое время можете изменить конфигурацию сервера SSH в файле %s.

source: SSH access
ru: Доступ к серверу через SSH

source: Host
ru: Хост

source: Port
ru: Порт

source: On this server is detected Very Secure FTP Daemon (vsftpd).
ru: На сервере обнаружен Very Secure FTP Daemon (vsftpd).

source: It is recommended to configure the server FTP.
ru: Рекомендуется провести настройку сервера FTP.

source: WARNING: The version %s of the vsftpd might be outdated.\nRecommended to use the version not lower than 3.0.2.
ru: ВНИМАНИЕ: Версия vsftpd %s может быть устаревшей.\nРекомендуется использовать программу не ниже версии 3.0.2, дабы избежать проблем с доступом к FTP.

source: Press Y, to try to install version %s.\nTo cancel, press N.
ru: Нажмите Y, чтобы попробовать установить версию %s.\nДля отмены установки, нажмите N.

source: When users connect to the FTP server to the client can display a welcoming message. For example: Welcome to my FTP!
ru: При подключении к FTP серверу можно вывести в клиент пользователя текст приветствия. Текст приветствия - небольшое сообщение или фраза.\nНапример, текст может быть следующим: Welcome to my FTP!

source: Do you want to enter a welcoming message?
ru: Хотите ввести текст приветствия?

source: Enter the welcoming message. Use only English letters:
ru: Введите строку приветствия. Используйте только английские буквы:

source: Do you want to to log connections to the server FTP?
ru: Хотите вести учет подключений к серверу FTP?

source: Do you want to allow IPv6?
ru: Разрешить использование IPv6?

source: FTP-server can operate in passive and/or active mode.\nActive mode for the server more secure.\nPassive mode is more secure for users and can be most preferred.\nRecommended to enable both modes.
ru: FTP-сервер может работать в пассивном и/или активном режиме.\nАктивный режим безопаснее для сервера.\nПассивный режим безопаснее для клиента.\nРекомендуется включить оба режима.

source: Allow passive mode?
ru: Разрешить пассивный режим?

source: For the passive mode will be used port numbers range from %s to %s.\nYou can change this in the configuration file: %s.
ru: Для работы пассивного режима будут использоваться порты от %s до %s.\nЕсли этого будет не хватать, можно расширить диапазон в файле %s.

source: Allow active mode?
ru: Разрешить активный режим?

source: Allowing access to the FTP without shell …
ru: Разрешение доступа к FTP без shell …

source: Configuring xinetd for vsftpd …
ru: Создание правил xinetd для vsftpd …

source: Failed to create the configuration of xinetd for vsftpd.
ru: Не удалось создать конфигурацию xinetd для vsftpd.

source: It is recommended to test the FTP.\nThe testing process can take several minutes.
ru: Рекомендуется провести тестирование FTP, путем проверки 21 порта.\nПроцесс тестирования может занять несколько минут, пока не будет инициализирована конфигурация FTP-сервера в xinetd.

source: Do you want to test FTP?
ru: Хотите провести тестирование FTP?

source: Etckeeper lets you keep /etc under version control.
ru: Etckeeper - программа для ведения истории изменений файлов конфигурации.\nПри установке или обновлении компонентов, вы сможете фиксировать состояние файлов конфигурации в системе контроля версий.\nЭто может быть полезно при случайном сбросе конфигурации отдельных компонентов системы.

source: File %s was not found.
ru: Файл %s не найден.

source: Configuring %s …
ru: Конфигурация %s …

source: Iptables is an extremely flexible firewall utility built for Linux operating systems.
ru: Iptables - утилита командной строки, является стандартным интерфейсом управления работой межсетевого экрана (брандмауэра) netfilter.

source: Do you want to allow external ping of the server?
ru: Разрешить внешний ping сервера?

source: Do you want to see the rules created for %s?
ru: Хотите посмотреть созданные правила для %s?

source: Do you want to create rules for %s?
ru: Создать правила для %s?

source: MySQL is an open-source relational database management system.
ru: MySql - популярная, бесплатная реляционная СУБД.

source: Come up and enter the root password for %s:
ru: Придумайте и введите пароль суперпользователя (root) для %s:

source: Without password %s is unsafe!
ru: Без пароля сервер %s будет уязвим!

source: %s server was not configured correctly. Operation canceled by the user.
ru: Сервер %s не был настроен правильно. Операция прервана пользователем.

source: Setting the root password for %s …
ru: Установка пароля root для %s …

source: MySql server
ru: Сервер MySql

source: Login
ru: Имя пользователя

source: Password
ru: Пароль

source: Do you want to test?
ru: Хотите провести тестирование?

source: Testing can take a long time.\nIf you want to stop testing, press Q.
ru: Тестирование может занять длительное время.\nЕсли вы захотите прервать тестирование, нажмите клавишу Q.

source: Testing completed.
ru: Проверка завершена.

source: phpMyAdmin is a free and open source tool written in PHP intended to handle the administration of MySQL with the use of a web browser.
ru: Для управления MySql рекомендуется установить веб-панель - phpMyAdmin.

source: Enter the address of the server %s:
ru: Введите адрес сервера %s:

source: Enter the port number of the server %s:
ru: Введите порт сервера %s:

source: PostgreSQL is an object-relational database management system (ORDBMS) with an emphasis on extensibility and standards-compliance.
ru: PostgreSQL - свободная, высокопроизводительная, легко масштабируемая объектно-реляционная система управления базами данных (СУБД).

source: PostgreSQL server
ru: Сервер PostgreSQL

source: The system found a package %s. Installing is not required.
ru: В системе найден пакет %s. Установка пакета не требуется.

source: Would you like to configure %s?
ru: Хотите провести конфигурацию %s?

source: Sudo is a program that allows users to run programs with the security privileges of another user, by default the superuser.
ru: Программа sudo предназначена для предоставления пользователям ограниченных прав суперпользователя, для выполнения задач по управлению сервером и сохранения приемлемого уровня безопасности.

source: An error occurred while installing sudo. Continued impossible.
ru: Произошла ошибка при установке sudo. Без sudo продолжать не имеет смысла.

source: Configuring %s.
ru: Конфигурация %s.

source: Adding %s to the %s …
ru: Добавление пользователя %s в группу %s …

source: Trusted users must be members of the sudo group.
ru: Для полноценной работы с sudo, доверенные пользователи должны входить в группу sudo.

source: Do you want to add a new member to the %s?
ru: Хотите добавить пользователя в группу %s?

source: Do you want to add the user %s to the group %s?
ru: Хотите добавить пользователя %s в группу %s?

source: Enter a username, which must be added to the %s:
ru: Введите имя пользователя, которого следует добавить в группу %s:

source: Error: User %s not found.
ru: Ошибка: Пользователь %s не найден.

source: Error: Username is required. Value cannot be empty.
ru: Ошибка: Имя пользователя не может быть пустым.

source: On this server detected service inetd.\nIt is recommended to replace it with a new service - xinetd.
ru: На сервере обнаружена устаревшая служба inetd.\nРекомендуется заменить её на xinetd.

source: Xinetd service is needed to manage the network connections and access control.
ru: Служба xinetd необходима для управления сетевыми соединениями, контроля доступа, протоколирования и управления другими службами по расписанию.

source: Xinetd service is already installed. Additional action is not required.
ru: Служба xinetd уже установлена. Дополнительные действия не требуются.

source: Unknown error.
ru: Неизвестная ошибка.

source: Enter password:
ru: Введите пароль:

source: Confirm password:
ru: Введите пароль еще раз:

source: Password confirmation is incorrect.
ru: Повтор пароля указан неверно.

source: Do you want to cancel?
ru: Хотите прервать операцию?

source: Enter host:
ru: Введите хост:

source: Enter the recipient address. For example: example@example.org:
ru: Введите адрес получателя. Например, example@example.org:

source: [Y/n]
ru: [Д/н]

source: [y/N]
ru: [д/Н]

source: [Y/N]
ru: [Д/Н]

source: Enter Y or N!
ru: Ожидается ввод символов Y или N!

source: Error: Text is required.
ru: Ошибка: Значение параметра text не может быть пустым.

source: [ Success ]
ru: [ Успех ]

source: [ Fail ]
ru: [ Ошибка ]

source: [ No found ]
ru: [ Не найдено ]

source: [ Cancelled ]
ru: [ Отменено ]

source: Error: Label text is required.
ru: Ошибка: Значение параметра text не может быть пустым.

source: Including %s …
ru: Подключение %s …

source: Failed to include %s.
ru: Не удалось подключить %s.

source: Insufficient permissions to execute the command. Try to run the script as root.
ru: Недостаточно прав для выполнения операции. Попробуйте выполнить скрипт от имени суперпользователя.

source: Enter the IP of the server:
ru: Введите IP данного сервера:

source: IP %s is correct?
ru: Адрес %s правильный?

source: IP-address is required!
ru: Необходимо указать IP-адрес этого сервера!

source: Parametes is required.
ru: Отсутствуют параметры. Продолжение невозможно.

source: Key is required.
ru: Необходимо указать ключ.

source: File '%s' not found.
ru: Файл '%s' не найден.

source: The directory structure of HTAN is damaged!
ru: Структура каталогов HTAN повреждена!

source: Required BASH v4.0 or later!
ru: Требуется версия BASH не ниже 4.0!

source: No access to the file %s.
ru: Отсутствует доступ к файлу %s.

source: Key is required. Value can not be empty.
ru: Необходимо указать имя параметра. Значение не может быть пустым.

source: File %s
ru: Файл %s

source: [ Updated ]
ru: [ Обновлено ]

source: [ Added ]
ru: [ Добавлено ]

source: Section name is required. Value can not be empty.
ru: Необходимо указать имя секции. Значение не может быть пустым.

source: Marker name is required. Value can not be empty.
ru: Необходимо указать имя маркера. Значение не может быть пустым.

source: Including the common …
ru: Подключение common …

source: You must specify the name of the package in the first parameter!
ru: Ошибка: Необходимо указать название пакета в первом параметре!

source: Installing %s is not required
ru: Установка %s не требуется.

source: Installing %s …
ru: Установка %s …

source: Can not install %s. Please try to install manually.
ru: Не удалось установить %s. Попробуйте выполнить операцию вручную.
