Repository: Juan-Alvarez/htan
Catalog: localization/*/LC_MESSAGES/htan.po
Languages: ru

source: For details, see the log file: %s.
ru: Для получения подробностей, ознакомьтесь с файлом журнала %s.

source: Last log records:
ru: Последние записи журнала:

source: Updating the package cache …
ru: Обновление информации о пакетах …

source: Updating packages …
ru: Обновление пакетов …

source: %s is already running.
ru: Служба %s уже запущена.

source: Starting the service %s …
ru: Запуск службы %s …

source: Unable to start the service %s. Try to perform the operation manually.
ru: Не удалось запустить %s. Попробуйте выполнить операцию вручную.

source: Stopping the service %s …
ru: Остановка службы %s …

source: Error: Service name is required!
ru: Ошибка: Необходимо указать имя службы!

source: Unable to configure %s. The template file is not specified.
ru: Невозможно настроить %s. Файл шаблона не указан.

source: Unable to configure %s. The hostname is not specified.
ru: Невозможно настроить %s. Имя хоста не указано.

source: Site %s already exists.
ru: Сайт %s уже существует.

source: Do you want to overwrite the configuration file of the site?
ru: Хотите перезаписать файл конфигурации сайта?

source: Configure %s with %s …
ru: Добавление сайта %s в %s …

source: Activation %s …
ru: Активация сайта %s …

source: If the current server to test, for the convenience can be set the %s in the file /etc/hosts. It allows to access the site through a browser.
ru: Если этот сервер используется для тестирования и адрес %s не является настоящим, для удобства можно прописать его в файле /etc/hosts. Это позволит обращаться к сайту через браузер.

source: Do not do this if the server does not for tests!
ru: Но не стоит этого делать, если сервер настоящий/боевой!

source: Are you want add %s to the /etc/hosts?
ru: Хотите добавить %s в /etc/hosts?

source: Adding the hostname to the /etc/hosts …
ru: Добавление записи в /etc/hosts …

source: On the client machines, you can also associate the %s with the %s. For Windows, the hosts file can be found in the folder C:\Windows\System32\drivers\etc.
ru: На клиентских машинах вы также можете ассоциировать %s с адресом сервера %s, чтобы работать с сайтом. Если у вас Windows, то файл hosts можно найти в папке C:\Windows\System32\drivers\etc.

source: Once testing is complete, to avoid problems, do not forget to remove %s of hosts on the server and clients.
ru: Если хост %s в будущем станет полноценным и доступным для внешнего мира, не забудьте удалить запись из ваших файлов hosts (на сервере и у клиентов), чтобы избежать путаницы.

source: Time synchronization …
ru: Синхронизация времени …

source: Press any key to continue...
ru: Нажмите любую клавишу для продолжения...

source: Apache Subversion (often abbreviated SVN, after the command name svn) is a software versioning and revision control system.
ru: Subversion - свободная централизованная система управления версиями.

source: On this server is detected the package %s.
ru: На сервере обнаружен пакет %s.

source: Creating group %s …
ru: Создание группы %s …

source: Creating a folder for the repositories …
ru: Создание папки для хранилищ …

source: Do you want to add a new project in SVN?
ru: Хотите добавить новый проект в SVN?

source: Enter a project name (folder name: English, wihout spaces):
ru: Введите название проекта (имя папки: на английском, без пробелов):

source: Creating %s …
ru: Создание %s …

source: Getting %s …
ru: Получение %s …

source: Downloading %s …
ru: Загрузка %s …

source: The project with the same name already exists.
ru: Проект с таким названием уже существует.

source: Enabling of the module %s …
ru: Включение модуля %s …

source: List of users to access the server is located in a file:
ru: Список пользователей, которым разрешен доступ к серверу, расположен в файле:

source: Use the following command to add a new user:
ru: Используйте следующую команду для добавления новых пользователей:

source: Creating a folder %s …
ru: Создание мамки %s …

source: Set permissions on the %s …
ru: Установка разрешений для %s …

source: Creating the necessary files …
ru: Создание необходимых файлов …

source: The parameter 'name' is required. Value cannot be empty.
ru: Необходимо указать значение параметра name.\nЗначение не может быть пустым.

source: Do you want to add an administrator to the SVN server?
ru: Хотите добавить администратора сервера SVN?

source: Enter a username:
ru: Введите имя пользователя:

source: Failed to create the user.
ru: Не удалось создать пользователя.

source: Accounts:
ru: Учетные записи:

source: Activation is not required.
ru: Активация не трубуется.

source: Come up and enter a password for %s:
ru: Придумайте и введите пароль для %s:

source: Do you want to set a new password to the user %s?
ru: Хотите поменять пароль у пользователя %s?

source: Updating %s …
ru: Обновление %s …

source: Recommended to install %s.
ru: Рекомендуется установить %s.

source: Check for updates %s.
ru: Проверьте обновления %s.

source: %s not found.
ru: %s не найден(а).

source: To manage the server, you can install the free web panel SmallServerAdmin.
ru: Для управления сервером можно установить бесплатную веб-панель SmallServerAdmin.

source: Probably, SmallServerAdmin already installed.
ru: Вероятно, панель SmallServerAdmin уже установлена.

source: Do you want to install the server control panel?
ru: Установить панель управления сервером?

source: Do you want to add the permission to access the panel?
ru: Хотите добавить разрешение на доступ к панели?

source: Access to the panel is not possible without login and password?\nTo grant permission to access the panel, run the following command:\nsudo htpasswd -dcb %s usersnameToAccess userPassword
ru: Доступ к панели будет невозможен без ввода логина и пароля.\nЧтобы предоставить разрешение на доступ к панели, выполните следующую команду:\nsudo htpasswd -dcb %s usersname password\n, где usersname - имя пользователя, password - пароль.

source: The panel will work with the server via SSH.\nAll commands will be executed through sudo.
ru: Панель будет работать с сервером по SSH.\nВсе команды будут выполняться через sudo.

source: Enter a username to create:
ru: Введите имя нового пользователя:

source: User %s already exists.
ru: Пользователь %s уже существует.

source: For safety reasons, it is recommended to create a new user for the panel.
ru: В целях безопасности, рекомендуется создать нового пользователя для панели.

source: Do you still want to use the user %s?
ru: Вы все еще хотите использовать пользователя %s?

source: Adding permissions for %s …
ru: Добавление разрешения для %s …

source: Setting the password for %s …
ru: Установка пароля для %s …

source: Do you want to try again?
ru: Хотите попробовать еще раз?

source: The user %s is a member of %s.
ru: Пользователь %s состоит в группе %s.

source: Daemon is designed to start and stop processes, and execution of any commands.\nMainly HTAN.Runner created for fastcgi-mono-server automatic start, but it can also be used for other purposes.
ru: Служба HTAN.Runner предназначен для запуска и остановки процессов, выполнения различных команд.\nГлавным образом HTAN.Runner создавался для автоматического запуска fastcgi-mono-server, но его также можно использовать и для других целей.

source: Additional action is not required.
ru: Дополнительные действия не требуются.

source: Extraction …
ru: Извлечение …

source: Extraction %s …
ru: Извлечение %s …

source: Daemon registration …
ru: Регистрация службы …

source: Preparing %s …
ru: Подготовка %s …

source: Preparing …
ru: Подготовка …

source: Removing %s …
ru: Удаление %s …

source: Copying …
ru: Копирование …

source: Copying %s …
ru: Копирование %s …

source: You can add site to access the %s, or do it later, when installing SmallServerAdmin. Recommend using SmallServerAdmin.
ru: Можно создать сайт для доступа к %s сейчас, либо сделать это позже, в процессе установки SmallServerAdmin. Рекомендуется использовать SmallServerAdmin.

source: To increase security it is recommended to restrict access to the panel by IP.
ru: Для повышения уровня безопасности рекомендуется ограничить доступ к панели по IP.

source: Do you want to restrict access by IP?
ru: Хотите ограничить доступ к панели сейчас?

source: Enter a network or address for allow access:
ru: Введите адрес или сеть, которым должен быть разрешен доступ:

source: Do you want to add another address?
ru: Хотите добавить еще один адрес?
